app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'Test@gmail.com'
 LIMIT 1
---
    public function login(){
        $email = $this->request->getVar("email");
        $password = $this->request->getVar("password");
        $userModel = new AuthModel();
        $userinfo = $userModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `email` = 'Test@gmail.com'
 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$NAKxjwbdfOD.6AjRWqv9ZuTyPAT.Sg.AIZ.iwkV9Dml7qNsKwdTRq'
WHERE `users`.`id` IN ('1')
---
    public function resetPasswordpost()
    {
        $email = $this->request->getVar("email");
        $password = $this->request->getVar("password");
        $password = password_hash($password, PASSWORD_DEFAULT);

        $userModel = new AuthModel();
        $userinfo = $userModel->where('email', $email)->first();
        if($userinfo){
            $id = $userinfo['id'];
            $data = [
                'password' => $password,
            ];
            $userModel->update($id, $data);