app/Controllers/EventsController.php

SELECT *
FROM `events`
---
    public function index()
    {
        $route = $this->routes;
        $masters = $this->masters;
        $group = $this->routegroupname;
        $detailsModel = new EventsModel();
        $selectDetails = $detailsModel->findAll();