app/Controllers/MemberController.php

    public function index()
    {
        $route = $this->routes;
        $masters = $this->masters;
        $group = $this->routegroupname;
        $detailsModel = new MemberModel();
        $selectDetails = $detailsModel->findAll();
---
SELECT *
FROM `member`