app/Controllers/RoleSetup.php

SELECT *
FROM `rolesetup`
---
    public function index()
    {
        $master = $this->permissionname;
        $detailsModel = new Addrolesetup();
        $selectDetails = $detailsModel->findAll();

SELECT *
FROM `rolesetup`
WHERE `uid` = '9c00e8b3a63b1382'
 LIMIT 1
---
    public function editPage($master,$uid)
    {
        $permission = permissiontypecheck($this->permissionname,'edit');
        if(!$permission){
            session()->setFlashdata('error', 'You have not permission to access this page!');
            return redirect()->to("$master");
        }
        $detailsModel = new Addrolesetup();
        $selectDetails = $detailsModel
            ->where('uid', $uid)
            ->first();

SELECT *
FROM `rolesetup`
WHERE `id` = '1'
 LIMIT 1
UPDATE `rolesetup` SET `uid` = '9c00e8b3a63b1382', `discription` = 'Super Admin sdfsdfsdfsdfsdfsdf', `created_at` = '2025-03-15 10:13:23', `updated_at` = '2025-03-15 10:33:17'
WHERE `rolesetup`.`id` IN ('1')
---
    public function dataUpdate(){
        $permission = permissiontypecheck($this->permissionname,'edit');
        if(!$permission){
            return $this->response->setJSON([
                'status' => 'error',
                'locationChange' => true,
                'message' => 'Your are not having permission for access this!!'
            ]);
        }
        $detailsModel = new Addrolesetup();

        $id = $this->request->getVar(index: "edit");
        $selectedValue  = $detailsModel->where('id', $id)->first();
        $uid = $selectedValue['uid'];

        $data = $this->request->getVar("addrolesid");
        $data = json_decode($data, true);
        if (json_last_error() !== JSON_ERROR_NONE) {
            throw new \Exception("Invalid JSON received in addrolesid");
        }
        $processedData = [];
        foreach ($data as $item) {
            $item['uid'] = $uid;
            $item['updated_at'] = date('Y-m-d H:i:s');
            $processedData[] = $item;
        }
        foreach ($processedData as $record) {
            $detailsModel->update($id, $record);